tap "nikitabobko/tap" # Aerospace
tap "jorgerojas26/lazysql" 

# CLI Tools
brew "git"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "htop"
brew "lazygit"
brew "lazysql"
brew "awscli"
brew "jq"
brew "yq"
brew "gh"
brew "delta"
brew "tmux"
brew "stow"
brew "neovim"
brew "kubectl"       # Kubernetes CLI
brew "tailscale"     # Secure mesh VPN for homelab and remote access

# Languages n stuff
brew "python"
brew "pipx"
brew "node"
brew "nvm"
brew "pnpm"
brew "go"
brew "uv"
brew "ruff"
brew "openjdk@17"
brew "openjdk@21"
brew "openjdk@25"
brew "opencode"

# GNU Utilities
brew "coreutils"
brew "gnu-sed"
brew "findutils"
brew "gawk"

# GUI Applications
cask "iterm2"
cask "visual-studio-code"
cask "raycast"
cask "docker"
cask "ghostty"
cask "nikitabobko/tap/aerospace"
cask "caffeine"
cask "discord"
cask "chatgpt"
cask "shottr"
cask "cursor"
cask "arc"
cask "google-chrome"
cask "google-drive"
cask "whatsapp"
cask "jetbrains-toolbox"
cask "intellij-idea"
cask "postman"
cask "pgadmin4"
cask "codex"
cask "claude-code"
# cash "zoom" - I don't want to install this by default

# Fonts
cask "font-jetbrains-mono-nerd-font"
